<a href="https://colab.research.google.com/github/benvictoria21/pandas/blob/master/sale_dataset.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt

In [4]:
sale = pd.read_csv("https://raw.githubusercontent.com/benvictoria21/pandas/master/dataset/Sales.csv")
sale

          Date Daily Amount Total Amount
0       May 15    $1,200.00    $1,200.00
1       May 16       $60.00    $1,260.00
2       May 17       $35.00    $1,295.00
3       May 18        $0.00    $1,295.00
4       May 19       $65.00    $1,360.00
..         ...          ...          ...
140  October 2          NaN          NaN
141  October 3          NaN          NaN
142  October 4          NaN          NaN
143  October 5          NaN          NaN
144  October 6          NaN          NaN

[145 rows x 3 columns]

In [37]:
sale.head()

             Date Daily Amount Total Amount
122  September 14          NaN    $4,756.00
123  September 15          NaN    $4,756.00
125  September 17          NaN    $4,791.00
126  September 18          NaN    $4,791.00
127  September 19          NaN    $4,791.00

In [38]:
sale.tail()

          Date Daily Amount Total Amount
140  October 2          NaN          NaN
141  October 3          NaN          NaN
142  October 4          NaN          NaN
143  October 5          NaN          NaN
144  October 6          NaN          NaN

In [39]:
sale.describe

<bound method NDFrame.describe of              Date Daily Amount Total Amount
122  September 14          NaN    $4,756.00
123  September 15          NaN    $4,756.00
125  September 17          NaN    $4,791.00
126  September 18          NaN    $4,791.00
127  September 19          NaN    $4,791.00
128  September 20          NaN    $4,791.00
131  September 23          NaN    $4,931.00
132  September 24          NaN    $4,931.00
133  September 25          NaN    $4,931.00
137  September 29          NaN    $5,151.00
138  September 30          NaN    $5,151.00
139     October 1          NaN          NaN
140     October 2          NaN          NaN
141     October 3          NaN          NaN
142     October 4          NaN          NaN
143     October 5          NaN          NaN
144     October 6          NaN          NaN>

In [40]:
sale.info

<bound method DataFrame.info of              Date Daily Amount Total Amount
122  September 14          NaN    $4,756.00
123  September 15          NaN    $4,756.00
125  September 17          NaN    $4,791.00
126  September 18          NaN    $4,791.00
127  September 19          NaN    $4,791.00
128  September 20          NaN    $4,791.00
131  September 23          NaN    $4,931.00
132  September 24          NaN    $4,931.00
133  September 25          NaN    $4,931.00
137  September 29          NaN    $5,151.00
138  September 30          NaN    $5,151.00
139     October 1          NaN          NaN
140     October 2          NaN          NaN
141     October 3          NaN          NaN
142     October 4          NaN          NaN
143     October 5          NaN          NaN
144     October 6          NaN          NaN>

In [41]:
sale.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 17 entries, 122 to 144
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Date          17 non-null     object
 1   Daily Amount  0 non-null      object
 2   Total Amount  11 non-null     object
dtypes: object(3)
memory usage: 544.0+ bytes

In [42]:
sale.shape

(17, 3)

In [43]:
import sqlite3

In [44]:
conn = sqlite3.connect("sale.db")
c = conn.cursor()

In [45]:
conn = sqlite3.connect("sale.db")
c = conn.cursor()

In [46]:
sale.to_sql("sale", conn, if_exists='replace')

/usr/local/lib/python3.6/dist-packages/pandas/core/generic.py:2615: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  method=method,

In [47]:
#See data
c.execute("""SELECT * FROM sale""")
rows = c.fetchall()
rows

[(122, 'September 14', None, '$4,756.00'),
 (123, 'September 15', None, '$4,756.00'),
 (125, 'September 17', None, '$4,791.00'),
 (126, 'September 18', None, '$4,791.00'),
 (127, 'September 19', None, '$4,791.00'),
 (128, 'September 20', None, '$4,791.00'),
 (131, 'September 23', None, '$4,931.00'),
 (132, 'September 24', None, '$4,931.00'),
 (133, 'September 25', None, '$4,931.00'),
 (137, 'September 29', None, '$5,151.00'),
 (138, 'September 30', None, '$5,151.00'),
 (139, 'October 1', None, None),
 (140, 'October 2', None, None),
 (141, 'October 3', None, None),
 (142, 'October 4', None, None),
 (143, 'October 5', None, None),
 (144, 'October 6', None, None)]

In [48]:
sale.to_excel("sale.xls")

pd.read_excel("sale.xls")

    Unnamed: 0          Date  Daily Amount Total Amount
0          122  September 14           NaN    $4,756.00
1          123  September 15           NaN    $4,756.00
2          125  September 17           NaN    $4,791.00
3          126  September 18           NaN    $4,791.00
4          127  September 19           NaN    $4,791.00
5          128  September 20           NaN    $4,791.00
6          131  September 23           NaN    $4,931.00
7          132  September 24           NaN    $4,931.00
8          133  September 25           NaN    $4,931.00
9          137  September 29           NaN    $5,151.00
10         138  September 30           NaN    $5,151.00
11         139     October 1           NaN          NaN
12         140     October 2           NaN          NaN
13         141     October 3           NaN          NaN
14         142     October 4           NaN          NaN
15         143     October 5           NaN          NaN
16         144     October 6           NaN          NaN